{"allTags":[],"articles":[{"name":"Solar Design and Installation Best Practices","published":true,"body":"<p class=\"p1\">This article is designed to expand your knowledge on how to build<span class=\"Apple-converted-space\">&nbsp; </span>a solar system according to best practices and why certain components are chosen and put together in order to perform better for longer.</p>\n<h2 class=\"p3\"><strong>What is a good solar design? </strong></h2>\n<p class=\"p1\">It&rsquo;s a design that will allow you to function continuously<span class=\"Apple-converted-space\">&nbsp; </span>off the grid for at least 20 years with your initial<span class=\"Apple-converted-space\">&nbsp; </span>investment. Nobody knows what the future brings but if you plan the solar design with a durability in mind and flexibility to expand and adapt to newer technologies to the current setup, then you will come out smiling no matter what the of the current grid provides you&hellip; Basically build an open state system with the best components at the time and with the ability to accommodate next generation capabilities into the system.</p>\n<h2 class=\"p3\"><strong>Battery or Storage selection </strong></h2>\n<p class=\"p1\">So when you design always add more fat where it matters most. If you have the budget get the best batteries that your budget allows and get the ones with the longest warranty possible. Because storage is the most critical component of any solar installation make sure you chose well and you choose lithium batteries or whatever the latest industry leader recommended battery storage technology that the majority of people agree to be the best value for money and the longest duration of storage offered.</p>\n<p class=\"p1\">Somebody once told me 2 batteries are better than 1, 3 batteries are better than 2 etc.</p>\n<p class=\"p1\">The point is if budget allows invest in more than 1 storage device so that you can reap benefits like:</p>\n<p class=\"p1\">1. Survive for at least 2 charging cycles without any service interruption.</p>\n<p class=\"p1\">2. Allow for the load to be shared between multiple storage devices for extended consumption times.</p>\n<p class=\"p1\">3. Improve system performance since you will only be discharging the batteries in its goldilocks zone where it doesn&rsquo;t hurt the performance and it doesn&rsquo;t negatively affects the longevity of the battery array.</p>\n<p class=\"p1\">At this stage in time lithium batteries dominate the market because they are the best most stable storage technology. They are relatively cheap and reliable component of a solar installation (somebody once said that it will cost you double if you pay for the cheap stuff twice). Who knows what tomorrow<span class=\"Apple-converted-space\">&nbsp; </span>will bring in terms of future<span class=\"Apple-converted-space\">&nbsp; </span>storage technology but since we are living In the present we have to make the decision with current most widely accepted technology and the one that allows for longest charge-discharge usage cycles.</p>\n<h2 class=\"p3\"><strong>Solar Panel selection and design </strong></h2>\n<p class=\"p1\"><strong>Solar Efficiency </strong></p>\n<p class=\"p1\">In terms of technology at this stage Monocrystalline solar panels are more efficient because they are cut from a single source of silicon that puts<span class=\"Apple-converted-space\">&nbsp; </span>their efficiency is rating between 16 and 24% percent vs 14-20 percent for polycrystalline solar panels. Also read my <a href=\"https://freesolarza.co.za/knowledge-base/ar-64an21avli01sakr\" target=\"_blank\" rel=\"noopener\">article</a> about power generation in cloudy and rainy weather here to understand better how weather condition will affect your power generation.</p>\n<p class=\"p3\"><strong>Solar Power generation principles -220volt goldilocks spot</strong></p>\n<p class=\"p1\">We are living on a planet with limited resources and we need to adopt a greener philosophy mindset to become more self-sufficient and not rely on traditional global warming power generation technologies that will waste our planets precious limited resources and kill the climate and the planet in the process for future generations.</p>\n<p class=\"p1\">With this philosophy in mind make sure when you design to always hit at least the 220v or higher aggregation voltage on your solar array so that you can power most appliances at home without having to rely on battery power or grid power during the day .That way you are truly and living up to the potential the sun provides us to be really free from the constrains of the traditional power grid .Not to mention that in our country 90 percent of the power generated comes from burning coal so any help we can provide with our greener more lean design would help our current situation and the future or our planets limited resources.</p>\n<p class=\"p1\">So do your heavy lifting during the day when the power from the sun is abundant and freely available in spades .Basically that means put your geyser on put your washing machine on put all the power hungry appliances in the house to good use during the day when the sun is up and shining so that you can utilize the energy of the sun for free.</p>\n<p class=\"p1\">At night slow down and go into maintenance mode on all appliances since you are going to be utilizing the storage to get you through to the next charging cycle. This is<span class=\"Apple-converted-space\">&nbsp; </span>a philosophy that has to become second nature to us all in order to help ourselves and help the planet and benefit from the free sunshine power during the day</p>\n<p class=\"p3\"><strong>Solar panel Design for<span class=\"Apple-converted-space\">&nbsp; </span>Looks</strong></p>\n<p class=\"p1\">AS with everything else<span class=\"Apple-converted-space\">&nbsp; </span>looks and esthetics are important in life, a well installed solar array design will please the eye with its esthetics and increase the value and status of your property and give solar a better reputation. Whether you go with solar tiles or good looking solar panel geometrically well positioned array design and looks will combine looks and functionality.</p>\n<p class=\"p3\"><strong>Solar panel designed to last </strong></p>\n<p class=\"p1\">As with all good things in life make sure you get the best quality panels you can afford in order for them to last the longest possible time so that you may reap the benefits of the power of the sun without having to exchange panels every few years due to planned obsolescence or bad quality products. My personal preference is Canadian Solar Panels that have built themselves a solid reputation for durability as well as excellent power generation in all weather conditions. Price tag has to matter as well but when you are planning to utilize a system for as long as 15 to 20 years don&rsquo;t skimp on a few thousand bucks in savings on the panels rather pay a bit more initially but you get the peace of mind that your critical system component will work no matter what.</p>\n<h2 class=\"p3\"><strong>Best practices for rooftop panel&rsquo;s installations </strong></h2>\n<ul>\n<li class=\"p1\">Where Body corporate allows rooftop installations or you happen to own the house here are some best practices on solar panels rooftop installations.</li>\n<li class=\"p1\">Make sure you utilize an approved solar installer and design for wind and seismic factors.</li>\n<li class=\"p1\">Make sure you don&rsquo;t damage any rooftop fixtures or tiles in the process nor do you create extra problems as a result of the panel&rsquo;s installation .Consult with the neighbors and architects for any hidden obstacles that may hinder the installation of the solar panels.</li>\n<li class=\"p1\">Leave enough room between panel arrays to gain access and movement around and below the panels in order to maintain them when needed without stepping them.</li>\n<li class=\"p1\">Ground the system well and include lightening protection.</li>\n</ul>\n<h2 class=\"p3\"><strong>Inverters and Solar charge controllers combos&nbsp;</strong></h2>\n<p class=\"p1\">So what is an inverter? Simply put inverter will take the battery power you have somehow managed to store and convert it to grid power at 220v so that your household appliances may utilize it.</p>\n<p class=\"p1\">What is a hybrid inverter? Hybrid<span class=\"Apple-converted-space\">&nbsp; </span>inverter is a combo device that can charge your battery storage devices using<span class=\"Apple-converted-space\">&nbsp; </span>either a solar panel array or the power grid or both based on their availability or preference.</p>\n<p class=\"p1\">Where budget and design allows choose your invertors well and place them closest to the Electric distribution board if possible so that you can minimize cabling requirements and satisfy esthetics in the house .The spot chosen must be well ventilated and it must be dry and possibly less populated since inverters can make quite a bit of noise depending on the load being generated or utilized</p>\n<p class=\"p1\">Best practice tip for Geysers and heavy load devices :always put them on an smart/intelligent<span class=\"Apple-converted-space\">&nbsp; </span>timer that you can control and program so that you can utilize the best possible power source at the time in order to recharge them successfully .For example I put my geysers at home on a timer to kick in every day at12:00 noon when the sun is the highest and strongest and after my battery storage array has been fully recharged only then I allow the other power hungry devices to kick in to recharge using the free power of the sun.</p>\n<p class=\"p1\">The battery voltage to your invertor voltage is critical for example when you buy a battery match 48 volt battery with 48 volt inverter etc.</p>\n<p class=\"p1\">Chose a reputable brand from a reputable provider that will not disappear after a few years and make sure you get your warranty printed and filed away for future eventuality.</p>\n<h2 class=\"p3\"><strong>Solar Best practice Installations</strong></h2>\n<ul>\n<li class=\"p1\">Verify arrays are functional once they are installed</li>\n<li class=\"p1\">Make sure joints and solar connectors don&rsquo;t have any dry or dead spot connections to prevent you from power generation</li>\n<li class=\"p1\">Choose the right gauge wire in order to provide maximum current to the inverter and make sure you install the fuse and DC circuit breakers trip protection</li>\n<li class=\"p1\">Check and double check cables by pulling them so they don&rsquo;t pop out from their joints and test individual panels and jointly them for electricity generation capabilities</li>\n<li class=\"p1\">Make sure you get your money&rsquo;s worth by testing the AMP capacity on each panel so that you know they are working optimally and the panels can do what they claim in terms of optimal power generation conditions</li>\n</ul>\n<h2 class=\"p3\"><strong>Solar Backups and alternatives&nbsp;</strong></h2>\n<p class=\"p1\">Let&rsquo;s call Eskom the first backup option when its available it can be a viable backup solution but would you trust them with your life or family&rsquo;s wellbeing these days that&rsquo;s a different question. I would much rather put my money in something more solid and reliable like GAS (second back option) .Its simple ,safe versatile and cheap.</p>\n<p class=\"p1\">Make sure you utilize gas or alternatives to normal grid power to power all the essential appliances</p>\n<p class=\"p1\">Where budget and opportunity allows invest in Gas geysers, Gas stove, Gas oven, Gas braai, Gas heaters</p>\n<p class=\"p1\">That&rsquo;s half your life already removed from the sickly dependency on Eskom power and the load shedding schedules.</p>\n<p class=\"p1\">Don&rsquo;t forget gas is several times cheaper than normal grid power and it has the added benefit of always be available and it doesn&rsquo;t cost you 30 % more every year like the normal Eskom grid power.</p>\n<p class=\"p1\">Don&rsquo;t forget Eskom is actively blocking the creation and expansion of green power so you can keep buying their dwindling power supply otherwise they will completely go out of business. Like a wounded beast they will fight for their survival and try and kill every other alternative source of energy competitors even though they cannot meet the power requirements of<span class=\"Apple-converted-space\">&nbsp; </span>the country .</p>","plainText":"This article is designed to expand your knowledge on how to build  a solar system according to best practices and why certain components are chosen and put together in order to perform better for longer.\n\nWhat is a good solar design?\n\nIt’s a design that will allow you to function continuously  off the grid for at least 20 years with your initial  investment. Nobody knows what the future brings but if you plan the solar design with a durability in mind and flexibility to expand and adapt to newer technologies to the current setup, then you will come out smiling no matter what the of the current grid provides you… Basically build an open state system with the best components at the time and with the ability to accommodate next generation capabilities into the system.\n\nBattery or Storage selection\n\nSo when you design always add more fat where it matters most. If you have the budget get the best batteries that your budget allows and get the ones with the longest warranty possible. Because storage is the most critical component of any solar installation make sure you chose well and you choose lithium batteries or whatever the latest industry leader recommended battery storage technology that the majority of people agree to be the best value for money and the longest duration of storage offered.\n\nSomebody once told me 2 batteries are better than 1, 3 batteries are better than 2 etc.\n\nThe point is if budget allows invest in more than 1 storage device so that you can reap benefits like:\n\n1. Survive for at least 2 charging cycles without any service interruption.\n\n2. Allow for the load to be shared between multiple storage devices for extended consumption times.\n\n3. Improve system performance since you will only be discharging the batteries in its goldilocks zone where it doesn’t hurt the performance and it doesn’t negatively affects the longevity of the battery array.\n\nAt this stage in time lithium batteries dominate the market because they are the best most stable storage technology. They are relatively cheap and reliable component of a solar installation (somebody once said that it will cost you double if you pay for the cheap stuff twice). Who knows what tomorrow  will bring in terms of future  storage technology but since we are living In the present we have to make the decision with current most widely accepted technology and the one that allows for longest charge-discharge usage cycles.\n\nSolar Panel selection and design\n\nSolar Efficiency\n\nIn terms of technology at this stage Monocrystalline solar panels are more efficient because they are cut from a single source of silicon that puts  their efficiency is rating between 16 and 24% percent vs 14-20 percent for polycrystalline solar panels. Also read my article about power generation in cloudy and rainy weather here to understand better how weather condition will affect your power generation.\n\nSolar Power generation principles -220volt goldilocks spot\n\nWe are living on a planet with limited resources and we need to adopt a greener philosophy mindset to become more self-sufficient and not rely on traditional global warming power generation technologies that will waste our planets precious limited resources and kill the climate and the planet in the process for future generations.\n\nWith this philosophy in mind make sure when you design to always hit at least the 220v or higher aggregation voltage on your solar array so that you can power most appliances at home without having to rely on battery power or grid power during the day .That way you are truly and living up to the potential the sun provides us to be really free from the constrains of the traditional power grid .Not to mention that in our country 90 percent of the power generated comes from burning coal so any help we can provide with our greener more lean design would help our current situation and the future or our planets limited resources.\n\nSo do your heavy lifting during the day when the power from the sun is abundant and freely available in spades .Basically that means put your geyser on put your washing machine on put all the power hungry appliances in the house to good use during the day when the sun is up and shining so that you can utilize the energy of the sun for free.\n\nAt night slow down and go into maintenance mode on all appliances since you are going to be utilizing the storage to get you through to the next charging cycle. This is  a philosophy that has to become second nature to us all in order to help ourselves and help the planet and benefit from the free sunshine power during the day\n\nSolar panel Design for  Looks\n\nAS with everything else  looks and esthetics are important in life, a well installed solar array design will please the eye with its esthetics and increase the value and status of your property and give solar a better reputation. Whether you go with solar tiles or good looking solar panel geometrically well positioned array design and looks will combine looks and functionality.\n\nSolar panel designed to last\n\nAs with all good things in life make sure you get the best quality panels you can afford in order for them to last the longest possible time so that you may reap the benefits of the power of the sun without having to exchange panels every few years due to planned obsolescence or bad quality products. My personal preference is Canadian Solar Panels that have built themselves a solid reputation for durability as well as excellent power generation in all weather conditions. Price tag has to matter as well but when you are planning to utilize a system for as long as 15 to 20 years don’t skimp on a few thousand bucks in savings on the panels rather pay a bit more initially but you get the peace of mind that your critical system component will work no matter what.\n\nBest practices for rooftop panel’s installations\nWhere Body corporate allows rooftop installations or you happen to own the house here are some best practices on solar panels rooftop installations.\nMake sure you utilize an approved solar installer and design for wind and seismic factors.\nMake sure you don’t damage any rooftop fixtures or tiles in the process nor do you create extra problems as a result of the panel’s installation .Consult with the neighbors and architects for any hidden obstacles that may hinder the installation of the solar panels.\nLeave enough room between panel arrays to gain access and movement around and below the panels in order to maintain them when needed without stepping them.\nGround the system well and include lightening protection.\nInverters and Solar charge controllers combos \n\nSo what is an inverter? Simply put inverter will take the battery power you have somehow managed to store and convert it to grid power at 220v so that your household appliances may utilize it.\n\nWhat is a hybrid inverter? Hybrid  inverter is a combo device that can charge your battery storage devices using  either a solar panel array or the power grid or both based on their availability or preference.\n\nWhere budget and design allows choose your invertors well and place them closest to the Electric distribution board if possible so that you can minimize cabling requirements and satisfy esthetics in the house .The spot chosen must be well ventilated and it must be dry and possibly less populated since inverters can make quite a bit of noise depending on the load being generated or utilized\n\nBest practice tip for Geysers and heavy load devices :always put them on an smart/intelligent  timer that you can control and program so that you can utilize the best possible power source at the time in order to recharge them successfully .For example I put my geysers at home on a timer to kick in every day at12:00 noon when the sun is the highest and strongest and after my battery storage array has been fully recharged only then I allow the other power hungry devices to kick in to recharge using the free power of the sun.\n\nThe battery voltage to your invertor voltage is critical for example when you buy a battery match 48 volt battery with 48 volt inverter etc.\n\nChose a reputable brand from a reputable provider that will not disappear after a few years and make sure you get your warranty printed and filed away for future eventuality.\n\nSolar Best practice Installations\nVerify arrays are functional once they are installed\nMake sure joints and solar connectors don’t have any dry or dead spot connections to prevent you from power generation\nChoose the right gauge wire in order to provide maximum current to the inverter and make sure you install the fuse and DC circuit breakers trip protection\nCheck and double check cables by pulling them so they don’t pop out from their joints and test individual panels and jointly them for electricity generation capabilities\nMake sure you get your money’s worth by testing the AMP capacity on each panel so that you know they are working optimally and the panels can do what they claim in terms of optimal power generation conditions\nSolar Backups and alternatives \n\nLet’s call Eskom the first backup option when its available it can be a viable backup solution but would you trust them with your life or family’s wellbeing these days that’s a different question. I would much rather put my money in something more solid and reliable like GAS (second back option) .Its simple ,safe versatile and cheap.\n\nMake sure you utilize gas or alternatives to normal grid power to power all the essential appliances\n\nWhere budget and opportunity allows invest in Gas geysers, Gas stove, Gas oven, Gas braai, Gas heaters\n\nThat’s half your life already removed from the sickly dependency on Eskom power and the load shedding schedules.\n\nDon’t forget gas is several times cheaper than normal grid power and it has the added benefit of always be available and it doesn’t cost you 30 % more every year like the normal Eskom grid power.\n\nDon’t forget Eskom is actively blocking the creation and expansion of green power so you can keep buying their dwindling power supply otherwise they will completely go out of business. Like a wounded beast they will fight for their survival and try and kill every other alternative source of energy competitors even though they cannot meet the power requirements of  the country .","img":{"url":"nhh.jpg","title":"Man with a plan"},"tags":["Solar installation","Solar installation best practices","How to install a solar panel","Solar design","Off the grid setup"],"date":"Wed May 24 2023","id":"ar-64an2ygli1ful8c"},{"name":"Solar charge controller comparison","published":true,"body":"<h2 class=\"p1\"><strong>Why Do You Need a Solar Charge Controller?</strong></h2>\n<p class=\"p2\">There are a variety of reasons that you need a charge controller for your solar system. First and foremost, solar charge controllers regulate energy flow from a solar array into the batteries. Without one, you could risk a surge that fries the system. They also contain safety features that prevent failures or fires in your battery bank, wiring, and other components.&nbsp;</p>\n<h2 class=\"p3\"><strong>Overload Protection</strong></h2>\n<p class=\"p2\">Overload or overcurrent protection is an essential function provided by solar charge controllers. Solar panels produce more power than a battery bank can handle. A battery can catch fire or otherwise malfunction when large power spikes occur. Overload protection prevents this danger from happening&mdash;instead of a battery malfunctioning, a fuse or breaker absorbs the excess power.&nbsp;</p>\n<h2 class=\"p3\"><strong>Low Voltage Disconnects</strong></h2>\n<p class=\"p4\">Attempting to draw power from a dead battery can cause irreversible damage. Solar charge controllers feature a low-voltage disconnect feature. When the battery reaches a set voltage indicating that you&rsquo;ve depleted its charge, the charge controller will disconnect the battery and prevent further use.&nbsp;</p>\n<p class=\"p2\">Once the battery is above the &ldquo;dead&rdquo; threshold again, the charge controller will reconnect it and allow it to provide power again.&nbsp;</p>\n<h2 class=\"p3\"><strong>Block Reverse Currents</strong></h2>\n<p class=\"p4\">Electrical current should only run in one direction in a solar setup: from the solar panels to the battery. Without a charge controller, power has the potential to run from the battery back to the panels. A solar charge controller acts as a valve, creating a one-way path for current to travel.</p>\n<h2 class=\"p1\">Which Is Better: MPPT or PWM Solar Charge Controllers?</h2>\n<p class=\"p2\">When it comes to efficiency, operating temperature, and cost, MPPT and PWM solar charge controllers differ widely.</p>\n<h2 class=\"p3\">MPPT (Maximum Power Point Tracking)</h2>\n<p class=\"p4\"><span class=\"s1\"><a href=\"https://blog.ecoflow.com/au/what-is-mppt-solar-charge-controller/\">MPPT (Maximum Power Point Tracking) controllers</a></span>&nbsp;are a newer, more advanced technology. They utilise a variety of features that make them a better choice over PWM controllers in most applications.&nbsp;</p>\n<p class=\"p4\">MPPT technology has existed for a few decades but has only recently evolved to become affordable for the average homeowner. Many estimates have determined that using an MPPT charge controller can increase&nbsp;<a href=\"https://www.energy.gov/eere/solar/solar-performance-and-efficiency\"><span class=\"s1\">system efficiency</span></a>&nbsp;by up to 30%.&nbsp;</p>\n<p class=\"p4\">Solar panels usually provide an excess voltage to the battery bank. MPPT controllers can convert this excess voltage into more amperage for the batteries. It reduces charging time and increases the amount of energy produced by a solar array. This function is sometimes referred to as a &ldquo;boost.&rdquo;&nbsp;</p>\n<p class=\"p4\">MPPT charge controllers also can handle varying voltages. In some instances, installing a mix of solar panels (some with 24V, some with 48V) can be useful. A combination of different voltage solar panels can provide power to large appliances and high-energy use systems. This demand would be impossible to accommodate when using a PWM controller. However, MPPT technology makes it possible to mix and match this way.&nbsp;</p>\n<p class=\"p4\">Peak sun hours are at their lowest in the winter. Cold, cloudy days can increase the power solar panels generate. Despite fewer daylight hours, the colder temperatures increase efficiency by preventing the system from overheating. MPPT controllers enhance this efficiency, collecting extra energy from cold solar panels and keeping the batteries charged over winter.</p>\n<p class=\"p4\">MPPT technology is standard in most residential solar applications.&nbsp;<a href=\"https://au.ecoflow.com/pages/solar-generators\"><span class=\"s1\">EcoFlow Solar Generators</span></a>&nbsp;are one example&mdash;they combine a charge controller, battery bank, and more into one compact power station&mdash;and at least one solar panel is included!</p>\n<p class=\"p5\"><strong>Pros</strong></p>\n<ul class=\"ul1\">\n<li class=\"li6\"><span class=\"s3\"><strong>Temperature Adaptability</strong>: MPPT controllers work well in a wide range of climates, including extreme cold and heat.&nbsp;</span></li>\n<li class=\"li6\"><span class=\"s3\"><strong>Efficiency</strong>: MPPT controllers can convert excess voltage into more amps for a battery. This results in more efficient use of your solar array and more power generation.</span></li>\n<li class=\"li7\"><span class=\"s3\"><strong>System Size</strong>: MPPT controllers work equally well with large, complex systems (such as a home array with varying voltages) and small systems (such as an RV array like EcoFlow&rsquo;s&nbsp;<a href=\"https://www.ecoflow.com/au/ecoflow-power-kits/series\"><span class=\"s1\">Power Kits</span></a>).&nbsp;</span></li>\n</ul>\n<p class=\"p5\"><strong>Cons</strong></p>\n<ul class=\"ul1\">\n<li class=\"li8\"><span class=\"s3\"><strong>Higher Upfront Cost</strong>: MPPT controllers are more expensive than PWM.&nbsp;</span></li>\n</ul>\n<h2 class=\"p3\"><strong>PWM (Pulse Width Modulation)</strong></h2>\n<p class=\"p4\">PWM (Pulse Width Modulation) controllers are a cheaper, less-advanced technology. They were popular in the first wave of residential and RV solar systems. However, MPPT controllers have decreased in price and are replacing PWM in most applications.&nbsp;</p>\n<p class=\"p4\">&ldquo;Pulse width modulation&rdquo; refers to the controller&rsquo;s function of slowly reducing the current as the batteries are charging. PWM controllers will continue to allow a trickle of current to charge a battery when it reaches maximum voltage. In other words, they will continuously provide a small amount of power to keep the batteries topped up.&nbsp;</p>\n<p class=\"p4\">PWM controllers can only utilise the voltage that matches your battery bank. For example, most PWM controllers are integrated with a 12V battery system. If your solar array is providing 18V, then that extra 6V of power will be wasted.&nbsp;</p>\n<p class=\"p4\">PWM controllers may be suitable for small systems. In these cases, the potential benefits of an MPPT controller may not outweigh the higher upfront cost.&nbsp;</p>\n<p class=\"p5\"><strong>Pros</strong></p>\n<ul class=\"ul1\">\n<li class=\"li6\"><span class=\"s3\"><strong>Cheaper Cost</strong>: PWM charge controllers are more affordable than MPPT.&nbsp;</span></li>\n<li class=\"li7\"><span class=\"s3\"><strong>Warm Weather</strong>: PWM controllers perform well when the connected panels operate in warm, sunny weather.</span></li>\n</ul>\n<p class=\"p5\"><strong>Cons</strong></p>\n<ul class=\"ul1\">\n<li class=\"li6\"><span class=\"s3\"><strong>Not Cold Tolerant</strong>: PWM controllers lose efficiency when temperatures are cold.&nbsp;</span></li>\n<li class=\"li9\"><span class=\"s3\"><strong>Inefficient</strong>: Excess voltage produced by the solar panels goes to waste with a PWM controller.&nbsp;</span></li>\n</ul>\n<h2 class=\"p1\"><strong>What Is the Advantage of MPPT Over PWM?</strong></h2>\n<p class=\"p4\">MPPT controllers are more efficient than PWM. They convert excess voltage into more amps, resulting in up to 30% more power generation. A system that uses an MPPT controller can gather more power from the same amount of panels. You can install fewer panels than a PWM system or enjoy the extra energy that your MPPT charge controller provides.&nbsp;</p>\n<p class=\"p4\">MPPT controllers perform much better in extreme cold and heat. Their temperature adaptability makes them a more durable and versatile option, particularly for areas with temperature fluctuations. PWM controllers tend to lose efficiency as the climate deviates from room temperature. They will be at a significant disadvantage unless you live in perfect year-round temperatures.&nbsp;</p>\n<p class=\"p4\">Complex solar arrays will require the use of an MPPT controller. With PWM technology, using 48V panels with a 12V battery bank is not possible. However, an MPPT controller can convert this excess voltage into more usable amperage for your 12V batteries.&nbsp;</p>\n<p class=\"p4\">Similarly, you may wish to use panels of varying voltages in your solar arrays, such as 12V, 24V, and 48V panels. Combining panels with varying voltages is only possible if you route them through an MPPT controller.&nbsp;</p>\n<h2 class=\"p1\"><strong>What Are the Disadvantages of MPPT?</strong></h2>\n<p class=\"p4\">MPPT charge controllers will generally cost a bit more than comparable PWM controllers. The difference is negligible, as the extra power generation will quickly compensate for the slight cost difference.&nbsp;</p>\n<p class=\"p11\">Another possible disadvantage of MPPT controllers is that they utilise speciality voltage and temperature sensors. While these sensors allow them to perform better, they are also extra components that have the potential to wear down or need replacing. PWM controllers contain simpler circuitry that is less prone to wear and tear.&nbsp;</p>\n<h2 class=\"p1\"><strong>Key Considerations When Choosing Between MPPT and PWM</strong></h2>\n<p class=\"p2\">There&rsquo;s more than the cost to consider when choosing the right solar charge controller for your system.&nbsp;</p>\n<h2 class=\"p3\"><strong>Conversion Efficiency</strong></h2>\n<p class=\"p4\">Conversion efficiency is one of the most significant considerations when choosing a solar charge controller. MPPT controllers provide battery banks with up to 30% more charge (depending on the rest of your system&rsquo;s components). The conversion efficiency is a clear advantage over PWM charge controllers.&nbsp;</p>\n<h2 class=\"p3\"><strong>Does Your System Already Include a Charge Controller?&nbsp;</strong></h2>\n<p class=\"p2\">Some solar systems may already include a charge controller. For instance,&nbsp;<a href=\"https://www.ecoflow.com/au/ecoflow-power-kits/series\"><span class=\"s1\">EcoFlow Power Kits</span></a>&nbsp;include five components in one package. An MPPT controller is integrated into the power kit, in addition to AC outlets, a battery bank, an AC/DC smart distribution panel, and more.&nbsp;</p>\n<h2 class=\"p3\"><strong>Solar Array Size</strong></h2>\n<p class=\"p4\">The size of your solar array can affect whether you require an MPPT controller&rsquo;s advantages. For instance, a 5 or 10-watt solar panel that feeds a 12V battery will not require an MPPT controller. A system this small will not utilise the advanced technology, and you would be better off saving money and going with a PWM controller.&nbsp;</p>\n<p class=\"p4\">Once your array grows to a few-hundred watts or more, the benefits of an MPPT controller become clear. You will notice the extra efficiency&mdash;your batteries will charge up to 30% faster and produce more energy from the same amount of solar panels.&nbsp;</p>\n<p class=\"p2\">If you have limited roof space, an MPPT controller will also help you gather every watt of energy from your smaller array.&nbsp;</p>\n<h2 class=\"p3\"><strong>Climate</strong></h2>\n<p class=\"p2\">Your region&rsquo;s climate can affect your choice of controller. If you live in Arizona or Southern California, you may receive full, direct sunshine nearly every day of the year. The constant sun exposure may lessen your need for the efficiency of an MPPT controller. However, those in cold and dreary climates will undoubtedly enjoy the extra power that an MPPT controller can help produce.&nbsp;</p>\n<h2 class=\"p3\"><strong>Price&nbsp;</strong></h2>\n<p class=\"p4\">The price should be a lesser consideration when choosing a charge controller. Anyone installing a residential solar system should make room for an MPPT charge controller in their budget.&nbsp;</p>\n<p class=\"p4\">That&rsquo;s not to say cost isn&rsquo;t a factor, particularly considering the&nbsp;<a href=\"https://sites.energycenter.org/solar/homeowners/cost\"><span class=\"s1\">cost of a typical residential solar system</span></a>. PWMs are more cost-friendly upfront. That said, an MPPT has higher efficiency, which means you stand to get more power from your system and yield higher returns over the long term when you install one.</p>\n<h2 class=\"p1\"><strong>Which Solar Charge Controller Is Right for You?</strong></h2>\n<p class=\"p4\">For consumer solar systems, there are only two choices of charge controllers: MPPT and PWM. The two types of controllers perform similar functions. However, MPPT has some clear advantages, especially over time.</p>\n<p class=\"p4\">Crafting your solar power system out of individual components can quickly become overwhelming. All-in-one solar setups are available to eliminate the research and concerns about compatibility that come with trying to install your own system.&nbsp;With the&nbsp;<a href=\"https://au.ecoflow.com/pages/home-ecosystem\"><span class=\"s1\">EcoFlow Smart Home Ecosystem</span></a>, you can customise your home solar power solution with highly efficient solar generators with MPPT charge controllers and other smart technologies already built-in.</p>\n<p class=\"p14\"><span class=\"s5\"><strong>MPPT&nbsp;Charge Controllers</strong>&nbsp;or&nbsp;<strong>Maximum Power Point Tracking&nbsp;</strong>Charge Controllers are a type of charge controllers that track the power for the maximum power point.</span></p>\n<p class=\"p15\">What is an MPPT Charge Controller?</p>\n<p class=\"p14\"><span class=\"s5\">The MPPT charge controller ensures that the loads receive&nbsp;<strong>maximum current</strong>&nbsp;to be used (by quickly charging the battery).Maximum power point could be understood as an&nbsp;<strong>ideal voltage</strong>&nbsp;at which the maximum power is delivered to the loads, with&nbsp;<strong>minimum losses</strong>.This is also commonly referred to as&nbsp;<strong>peak power voltage</strong>.</span></p>\n<p class=\"p15\">What is the maximum power point (MPP)?</p>\n<p class=\"p14\"><span class=\"s5\">The&nbsp;<strong>maximum power point (MPP)</strong>&nbsp;describes the point on a current voltage (I-V) curve at which the solar PV device generates the largest output i.e. where the product of current intensity (I) and voltage (V) is maximum.The MPP may change due to external factors such as temperature, light conditions and workmanship of the device.In order to ensure maximum power output (Pmax) of a solar PV device in view of these external factors,&nbsp;<strong>maximum power output trackers (MPPT)</strong>&nbsp;may be operated to regulate the resistance of the device.</span></p>\n<p class=\"p15\">How do MPPT charge controllers work?</p>\n<p class=\"p16\"><span class=\"s5\">Anyone familiar with the charging and discharging characteristics of the battery is familiar to the fact that the voltage of the battery varies with its charge content.As current flows from a high potential to low potential, the steeper the gradient or voltage difference, the greater is the&nbsp;<strong>flow of current</strong>.This potential gradient could be made steeper by two ways:</span></p>\n<ol class=\"ol1\">\n<li class=\"li16\"><span class=\"s5\">By increasing the output voltage of the Solar Panel</span></li>\n<li class=\"li17\"><span class=\"s5\">By decreasing the voltage of the battery (discharging the battery)</span></li>\n</ol>\n<p class=\"p15\">Using increased panel voltage to deliver maximum power</p>\n<p class=\"p14\"><span class=\"s5\">Now batteries could only be charged if the output voltage of the solar panel is greater than that of the batteries, to facilitate a flow of current from the panel to the battery.The output voltage of the panel depends on different factors, including the weather (irradiance). On a sunny day the output voltage may be higher than the&nbsp;<strong>rated output voltage</strong>, while during a cloudy day the output voltage is probably less.Normal controllers do not have the capacity to utilize this higher output voltage to deliver more power. However MPPT charge controllers have the ability to&nbsp;<strong>adjust the voltage</strong>&nbsp;in order to get a boost of current during times of peak demand.MPPT delivers higher than rated charge to the battery as they can adjust the voltage to current ratio.</span></p>\n<p class=\"p15\">Using battery voltage for delivering maximum power</p>\n<p class=\"p14\"><span class=\"s5\">Current and Voltage are inversely proportional to each other. With other words, if the current increases, the voltage drops and vice versa.By lowering the current by introducing some resistance in the path of the current, the MPPT charge controller can boost up the voltage.This&nbsp;<strong>voltage to current ratio</strong>&nbsp;adjustment is called Maximum power point tracking. MPPT typically increases the current to the battery by approximately 25% to 30%.Important to keep in mind is that a 80% discharged battery will&nbsp;<strong>charge faster</strong>&nbsp;than a 50% discharged battery.The reason for this is that when the battery starts to discharge, its voltage also reduces. The&nbsp;<strong>larger the gap</strong>&nbsp;between the solar panel output voltage and the battery voltage, the more current will flow into the battery, and the faster the battery will be charged.</span></p>\n<p class=\"p15\">Combined techniques for optimum battery charging</p>\n<p class=\"p18\"><span class=\"s5\">MPPT charge controllers use both principles mentioned above to deliver the maximum amount of power.This type of solar charge controllers come pre-programmed with&nbsp;<strong>adjustable set-points</strong>&nbsp;which can be edited and adjusted according to your needs.If you need to choose between a standard and a MPPT charge controller, usually paying a bit more for a proper MPPT controller is the way to go.</span></p>","img":{"url":"charge-controller.jpg","title":"Charge controller"},"tags":["MPPT","PWN","solar charge controllers","maximum power point"],"date":"Tue May 23 2023","id":"ar-64an21avli05cjdu","plainText":"Why Do You Need a Solar Charge Controller?\n\nThere are a variety of reasons that you need a charge controller for your solar system. First and foremost, solar charge controllers regulate energy flow from a solar array into the batteries. Without one, you could risk a surge that fries the system. They also contain safety features that prevent failures or fires in your battery bank, wiring, and other components. \n\nOverload Protection\n\nOverload or overcurrent protection is an essential function provided by solar charge controllers. Solar panels produce more power than a battery bank can handle. A battery can catch fire or otherwise malfunction when large power spikes occur. Overload protection prevents this danger from happening—instead of a battery malfunctioning, a fuse or breaker absorbs the excess power. \n\nLow Voltage Disconnects\n\nAttempting to draw power from a dead battery can cause irreversible damage. Solar charge controllers feature a low-voltage disconnect feature. When the battery reaches a set voltage indicating that you’ve depleted its charge, the charge controller will disconnect the battery and prevent further use. \n\nOnce the battery is above the “dead” threshold again, the charge controller will reconnect it and allow it to provide power again. \n\nBlock Reverse Currents\n\nElectrical current should only run in one direction in a solar setup: from the solar panels to the battery. Without a charge controller, power has the potential to run from the battery back to the panels. A solar charge controller acts as a valve, creating a one-way path for current to travel.\n\nWhich Is Better: MPPT or PWM Solar Charge Controllers?\n\nWhen it comes to efficiency, operating temperature, and cost, MPPT and PWM solar charge controllers differ widely.\n\nMPPT (Maximum Power Point Tracking)\n\nMPPT (Maximum Power Point Tracking) controllers are a newer, more advanced technology. They utilise a variety of features that make them a better choice over PWM controllers in most applications. \n\nMPPT technology has existed for a few decades but has only recently evolved to become affordable for the average homeowner. Many estimates have determined that using an MPPT charge controller can increase system efficiency by up to 30%. \n\nSolar panels usually provide an excess voltage to the battery bank. MPPT controllers can convert this excess voltage into more amperage for the batteries. It reduces charging time and increases the amount of energy produced by a solar array. This function is sometimes referred to as a “boost.” \n\nMPPT charge controllers also can handle varying voltages. In some instances, installing a mix of solar panels (some with 24V, some with 48V) can be useful. A combination of different voltage solar panels can provide power to large appliances and high-energy use systems. This demand would be impossible to accommodate when using a PWM controller. However, MPPT technology makes it possible to mix and match this way. \n\nPeak sun hours are at their lowest in the winter. Cold, cloudy days can increase the power solar panels generate. Despite fewer daylight hours, the colder temperatures increase efficiency by preventing the system from overheating. MPPT controllers enhance this efficiency, collecting extra energy from cold solar panels and keeping the batteries charged over winter.\n\nMPPT technology is standard in most residential solar applications. EcoFlow Solar Generators are one example—they combine a charge controller, battery bank, and more into one compact power station—and at least one solar panel is included!\n\nPros\n\nTemperature Adaptability: MPPT controllers work well in a wide range of climates, including extreme cold and heat. \nEfficiency: MPPT controllers can convert excess voltage into more amps for a battery. This results in more efficient use of your solar array and more power generation.\nSystem Size: MPPT controllers work equally well with large, complex systems (such as a home array with varying voltages) and small systems (such as an RV array like EcoFlow’s Power Kits). \n\nCons\n\nHigher Upfront Cost: MPPT controllers are more expensive than PWM. \nPWM (Pulse Width Modulation)\n\nPWM (Pulse Width Modulation) controllers are a cheaper, less-advanced technology. They were popular in the first wave of residential and RV solar systems. However, MPPT controllers have decreased in price and are replacing PWM in most applications. \n\n“Pulse width modulation” refers to the controller’s function of slowly reducing the current as the batteries are charging. PWM controllers will continue to allow a trickle of current to charge a battery when it reaches maximum voltage. In other words, they will continuously provide a small amount of power to keep the batteries topped up. \n\nPWM controllers can only utilise the voltage that matches your battery bank. For example, most PWM controllers are integrated with a 12V battery system. If your solar array is providing 18V, then that extra 6V of power will be wasted. \n\nPWM controllers may be suitable for small systems. In these cases, the potential benefits of an MPPT controller may not outweigh the higher upfront cost. \n\nPros\n\nCheaper Cost: PWM charge controllers are more affordable than MPPT. \nWarm Weather: PWM controllers perform well when the connected panels operate in warm, sunny weather.\n\nCons\n\nNot Cold Tolerant: PWM controllers lose efficiency when temperatures are cold. \nInefficient: Excess voltage produced by the solar panels goes to waste with a PWM controller. \nWhat Is the Advantage of MPPT Over PWM?\n\nMPPT controllers are more efficient than PWM. They convert excess voltage into more amps, resulting in up to 30% more power generation. A system that uses an MPPT controller can gather more power from the same amount of panels. You can install fewer panels than a PWM system or enjoy the extra energy that your MPPT charge controller provides. \n\nMPPT controllers perform much better in extreme cold and heat. Their temperature adaptability makes them a more durable and versatile option, particularly for areas with temperature fluctuations. PWM controllers tend to lose efficiency as the climate deviates from room temperature. They will be at a significant disadvantage unless you live in perfect year-round temperatures. \n\nComplex solar arrays will require the use of an MPPT controller. With PWM technology, using 48V panels with a 12V battery bank is not possible. However, an MPPT controller can convert this excess voltage into more usable amperage for your 12V batteries. \n\nSimilarly, you may wish to use panels of varying voltages in your solar arrays, such as 12V, 24V, and 48V panels. Combining panels with varying voltages is only possible if you route them through an MPPT controller. \n\nWhat Are the Disadvantages of MPPT?\n\nMPPT charge controllers will generally cost a bit more than comparable PWM controllers. The difference is negligible, as the extra power generation will quickly compensate for the slight cost difference. \n\nAnother possible disadvantage of MPPT controllers is that they utilise speciality voltage and temperature sensors. While these sensors allow them to perform better, they are also extra components that have the potential to wear down or need replacing. PWM controllers contain simpler circuitry that is less prone to wear and tear. \n\nKey Considerations When Choosing Between MPPT and PWM\n\nThere’s more than the cost to consider when choosing the right solar charge controller for your system. \n\nConversion Efficiency\n\nConversion efficiency is one of the most significant considerations when choosing a solar charge controller. MPPT controllers provide battery banks with up to 30% more charge (depending on the rest of your system’s components). The conversion efficiency is a clear advantage over PWM charge controllers. \n\nDoes Your System Already Include a Charge Controller? \n\nSome solar systems may already include a charge controller. For instance, EcoFlow Power Kits include five components in one package. An MPPT controller is integrated into the power kit, in addition to AC outlets, a battery bank, an AC/DC smart distribution panel, and more. \n\nSolar Array Size\n\nThe size of your solar array can affect whether you require an MPPT controller’s advantages. For instance, a 5 or 10-watt solar panel that feeds a 12V battery will not require an MPPT controller. A system this small will not utilise the advanced technology, and you would be better off saving money and going with a PWM controller. \n\nOnce your array grows to a few-hundred watts or more, the benefits of an MPPT controller become clear. You will notice the extra efficiency—your batteries will charge up to 30% faster and produce more energy from the same amount of solar panels. \n\nIf you have limited roof space, an MPPT controller will also help you gather every watt of energy from your smaller array. \n\nClimate\n\nYour region’s climate can affect your choice of controller. If you live in Arizona or Southern California, you may receive full, direct sunshine nearly every day of the year. The constant sun exposure may lessen your need for the efficiency of an MPPT controller. However, those in cold and dreary climates will undoubtedly enjoy the extra power that an MPPT controller can help produce. \n\nPrice \n\nThe price should be a lesser consideration when choosing a charge controller. Anyone installing a residential solar system should make room for an MPPT charge controller in their budget. \n\nThat’s not to say cost isn’t a factor, particularly considering the cost of a typical residential solar system. PWMs are more cost-friendly upfront. That said, an MPPT has higher efficiency, which means you stand to get more power from your system and yield higher returns over the long term when you install one.\n\nWhich Solar Charge Controller Is Right for You?\n\nFor consumer solar systems, there are only two choices of charge controllers: MPPT and PWM. The two types of controllers perform similar functions. However, MPPT has some clear advantages, especially over time.\n\nCrafting your solar power system out of individual components can quickly become overwhelming. All-in-one solar setups are available to eliminate the research and concerns about compatibility that come with trying to install your own system. With the EcoFlow Smart Home Ecosystem, you can customise your home solar power solution with highly efficient solar generators with MPPT charge controllers and other smart technologies already built-in.\n\nMPPT Charge Controllers or Maximum Power Point Tracking Charge Controllers are a type of charge controllers that track the power for the maximum power point.\n\nWhat is an MPPT Charge Controller?\n\nThe MPPT charge controller ensures that the loads receive maximum current to be used (by quickly charging the battery).Maximum power point could be understood as an ideal voltage at which the maximum power is delivered to the loads, with minimum losses.This is also commonly referred to as peak power voltage.\n\nWhat is the maximum power point (MPP)?\n\nThe maximum power point (MPP) describes the point on a current voltage (I-V) curve at which the solar PV device generates the largest output i.e. where the product of current intensity (I) and voltage (V) is maximum.The MPP may change due to external factors such as temperature, light conditions and workmanship of the device.In order to ensure maximum power output (Pmax) of a solar PV device in view of these external factors, maximum power output trackers (MPPT) may be operated to regulate the resistance of the device.\n\nHow do MPPT charge controllers work?\n\nAnyone familiar with the charging and discharging characteristics of the battery is familiar to the fact that the voltage of the battery varies with its charge content.As current flows from a high potential to low potential, the steeper the gradient or voltage difference, the greater is the flow of current.This potential gradient could be made steeper by two ways:\n\nBy increasing the output voltage of the Solar Panel\nBy decreasing the voltage of the battery (discharging the battery)\n\nUsing increased panel voltage to deliver maximum power\n\nNow batteries could only be charged if the output voltage of the solar panel is greater than that of the batteries, to facilitate a flow of current from the panel to the battery.The output voltage of the panel depends on different factors, including the weather (irradiance). On a sunny day the output voltage may be higher than the rated output voltage, while during a cloudy day the output voltage is probably less.Normal controllers do not have the capacity to utilize this higher output voltage to deliver more power. However MPPT charge controllers have the ability to adjust the voltage in order to get a boost of current during times of peak demand.MPPT delivers higher than rated charge to the battery as they can adjust the voltage to current ratio.\n\nUsing battery voltage for delivering maximum power\n\nCurrent and Voltage are inversely proportional to each other. With other words, if the current increases, the voltage drops and vice versa.By lowering the current by introducing some resistance in the path of the current, the MPPT charge controller can boost up the voltage.This voltage to current ratio adjustment is called Maximum power point tracking. MPPT typically increases the current to the battery by approximately 25% to 30%.Important to keep in mind is that a 80% discharged battery will charge faster than a 50% discharged battery.The reason for this is that when the battery starts to discharge, its voltage also reduces. The larger the gap between the solar panel output voltage and the battery voltage, the more current will flow into the battery, and the faster the battery will be charged.\n\nCombined techniques for optimum battery charging\n\nMPPT charge controllers use both principles mentioned above to deliver the maximum amount of power.This type of solar charge controllers come pre-programmed with adjustable set-points which can be edited and adjusted according to your needs.If you need to choose between a standard and a MPPT charge controller, usually paying a bit more for a proper MPPT controller is the way to go."},{"name":"Battery maintenance and low-voltage disconnect protection","published":true,"body":"<p class=\"p1\">The most vulnerable part of a solar system is the over utilization on the storage component &ndash; the batteries. In the case of GEL or Lead Acid batteries, they have a safe voltage protection chart that you may use to discharge the battery safely.</p>\n<p class=\"p1\">Over time, if the batteries are consistently discharged more than the safety recommendation, you will end up with broken batteries that cannot perform the function that they are intended to serve.</p>\n<p class=\"p1\">For lead acid 12 volt batteries you may safely discharge<span class=\"Apple-converted-space\">&nbsp; </span>around 50% of its capacity without damaging it permanently and for Gel batteries the DOD depth of discharge is around 30-40%, so safe voltage is 11.6 to 11.8. Most people have no idea how to safely protect their batteries from discharging it too much.</p>\n<figure class=\"image\"><img src=\"https://freesolarza.co.za/images/articles/discharge-chart.jpg\" alt=\"\" width=\"443\" height=\"443\">\n<figcaption>State of charge voltage chart vs percentage full</figcaption>\n</figure>\n<p class=\"p1\">&nbsp;</p>\n<h2 class=\"p1\">What is a low voltage disconnect?</h2>\n<p class=\"p1\">Discharging a battery to exhaustion will cause immediate, irreversible loss of capacity and life expectancy. Your system should employ low voltage disconnect (LVD) in the load circuits. Most DC to AC power inverters have this feature, and so do many charge controllers and power centers. Don&rsquo;t depend on human behavior to prevent over-discharge. It can be caused easily by accident or by an irresponsible user. Again, most inverters have LVD built-in but if there are DC loads on the system, please incorporate an LVD device.</p>\n<p class=\"p1\">Usually there are devices that can achieve the low voltage disconnect but I like to utilize the readymade cheap solution already on the market namely the solar charge controller.&nbsp;Connect all the load you want to consume to the solar charge controller make sure you setup the correct disconnect options in order to disconnect the battery at the desired disconnection point.</p>","img":{"url":"battery-array.jpg","title":""},"tags":["battery maintenance","low voltage discharge","battery safety"],"date":"Tue May 23 2023","id":"ar-64an21avli04mm6i","plainText":"The most vulnerable part of a solar system is the over utilization on the storage component – the batteries. In the case of GEL or Lead Acid batteries, they have a safe voltage protection chart that you may use to discharge the battery safely.\n\nOver time, if the batteries are consistently discharged more than the safety recommendation, you will end up with broken batteries that cannot perform the function that they are intended to serve.\n\nFor lead acid 12 volt batteries you may safely discharge  around 50% of its capacity without damaging it permanently and for Gel batteries the DOD depth of discharge is around 30-40%, so safe voltage is 11.6 to 11.8. Most people have no idea how to safely protect their batteries from discharging it too much.\n\nState of charge voltage chart vs percentage full\n\n\n\nWhat is a low voltage disconnect?\n\nDischarging a battery to exhaustion will cause immediate, irreversible loss of capacity and life expectancy. Your system should employ low voltage disconnect (LVD) in the load circuits. Most DC to AC power inverters have this feature, and so do many charge controllers and power centers. Don’t depend on human behavior to prevent over-discharge. It can be caused easily by accident or by an irresponsible user. Again, most inverters have LVD built-in but if there are DC loads on the system, please incorporate an LVD device.\n\nUsually there are devices that can achieve the low voltage disconnect but I like to utilize the readymade cheap solution already on the market namely the solar charge controller. Connect all the load you want to consume to the solar charge controller make sure you setup the correct disconnect options in order to disconnect the battery at the desired disconnection point."},{"name":"Solar power efficiency","published":true,"body":"<p class=\"p1\">How do you achieve power efficiency and survive in load shedding power outages without having to rely on Eskom power for your basic needs?&nbsp;The simpler the system is, the more efficient it is and the longer you can use it.&nbsp;In practical terms If you reduce the power needs and lower the voltage from 22v to 12v you can power your basic devices for up to 12hours.</p>\n<p class=\"p1\">And why is that important in a battery and system life cycle?&nbsp;Because after 12 hours the sun will shine again and recharge your battery, thus achieving a self-sustaining charge and consumption cycle. That way if you don&rsquo;t over drain your battery completely<span class=\"Apple-converted-space\">&nbsp; </span>and you have a few solar panels to recharge it every day, you can power your basic systems at home for free during the day and using battery stored electricity at night.</p>\n<p class=\"p1\">So what happens during the day when there is sunshine outside?&nbsp;Every second the sun is producing free energy and its sending it to use for free&hellip; all you need to do is capture it a few solar panels and then you can use it for free without any costs or grid power.&nbsp;The sun shines all the time producing the power for free and you can consume it for free as it gets produced and converted by your solar panels to 12v for your devices to use immediately.&nbsp;At the same time, any unutilized power by your devices is used to charge up your battery This way you achieve the fully sustained life cycle of solar power generation and consumption.</p>\n<p class=\"p1\">Remember a typical 100watt panel produces upto 23 volts of power and your battery can only utlize 12-14 volts to charge up anything extra is discarded if its not used ☺</p>\n<p class=\"p1\">So what can you charge with the <strong>12v Battery </strong>and <strong>12v power extension?</strong></p>\n<ul>\n<li class=\"p1\">Laptops (extra charger required)</li>\n<li class=\"p1\">Wi-fi Routers</li>\n<li class=\"p1\">Fiber box or ONT</li>\n<li class=\"p1\">Portable lights (12v)</li>\n<li class=\"p1\">Phone chargers</li>\n<li class=\"p1\">iPods, iPads, tablets</li>\n<li class=\"p1\">Cameras</li>\n<li class=\"p1\">Power banks</li>\n<li class=\"p1\">Anything else with a 12V power supply</li>\n<li class=\"p1\">Estimated battery lifetime is 12 hours between charging duration</li>\n</ul>","img":{"url":"12v-power-station.jpg","title":""},"tags":["efficient solar energy","12v solar powr","solar power on a cloudy day"],"date":"Tue May 23 2023","id":"ar-64an21avli04ftbq","plainText":"How do you achieve power efficiency and survive in load shedding power outages without having to rely on Eskom power for your basic needs? The simpler the system is, the more efficient it is and the longer you can use it. In practical terms If you reduce the power needs and lower the voltage from 22v to 12v you can power your basic devices for up to 12hours.\n\nAnd why is that important in a battery and system life cycle? Because after 12 hours the sun will shine again and recharge your battery, thus achieving a self-sustaining charge and consumption cycle. That way if you don’t over drain your battery completely  and you have a few solar panels to recharge it every day, you can power your basic systems at home for free during the day and using battery stored electricity at night.\n\nSo what happens during the day when there is sunshine outside? Every second the sun is producing free energy and its sending it to use for free… all you need to do is capture it a few solar panels and then you can use it for free without any costs or grid power. The sun shines all the time producing the power for free and you can consume it for free as it gets produced and converted by your solar panels to 12v for your devices to use immediately. At the same time, any unutilized power by your devices is used to charge up your battery This way you achieve the fully sustained life cycle of solar power generation and consumption.\n\nRemember a typical 100watt panel produces upto 23 volts of power and your battery can only utlize 12-14 volts to charge up anything extra is discarded if its not used ☺\n\nSo what can you charge with the 12v Battery and 12v power extension?\n\nLaptops (extra charger required)\nWi-fi Routers\nFiber box or ONT\nPortable lights (12v)\nPhone chargers\niPods, iPads, tablets\nCameras\nPower banks\nAnything else with a 12V power supply\nEstimated battery lifetime is 12 hours between charging duration"},{"name":"What is an automatic changeover switch?","published":true,"body":"<p class=\"p1\">When the main power from Eskom at home or business goes out, you need to switch automatically to alternative power supply source. In that case the device used to do this its changeover switch or transfer switch.</p>\n<h2 class=\"p2\">What is the Changeover Switch used for in our country?</h2>\n<p class=\"p1\">A changeover switch is an electrical switch that allows for the power to be changed from one electrical source to another and vice versa, either manually or automatically.</p>\n<p class=\"p1\">In our case, if you have a generator, solar system, or any other alternative that can take power from one place and put it back in the grid when the Eskom outages are in place, then you should consider utilizing a changeover switch to help you move seamlessly to the alternative source of power.</p>\n<p class=\"p1\">On the other hand, changeover switches can also prevent electrical accidents from occurring on the side of utility employees by making an electrical current move within the correct limits. Also, the changeover switch can prevent the sudden loss of power and thus save some sensitive appliances from burning out due to surges and sudden power loss the only caveat around this is that the alternative power source must be able to take over immediately as in the case of solar batteries storage power.</p>\n<p class=\"p1\">In fact, many industries have large and complex electrical systems with multiple generators or large storage solar system can utilize this device in order to get power transferred seamlessly.</p>\n<p class=\"p1\">Typical<span class=\"Apple-converted-space\">&nbsp; </span>use cases for the changeover switch are:</p>\n<ul class=\"ul1\">\n<li class=\"li5\">At home</li>\n<li class=\"li5\">Spaza shops</li>\n<li class=\"li5\">Hospitals</li>\n<li class=\"li5\">Schools</li>\n<li class=\"li5\">Warehouses</li>\n<li class=\"li5\">Small and medium sized businesses (SMB)</li>\n</ul>\n<p class=\"p1\">Practical example wiring at home to change over from one system to antother.</p>\n<p class=\"p1\">In the diagram above, the left side pointing to the grid must be connected to plus and minus to whatever you want to siwtch over. Lights or plugs switch only on the on the DB board and the grid can also be swtiched over rather than the entire load or main swtich.</p>","img":{"url":"changeover-switch.jpg","title":"Changeover switch"},"tags":["changeover switch","solar power best practices","safe renewable energy"],"date":"Tue May 23 2023","id":"ar-64an21avli0262km","plainText":"When the main power from Eskom at home or business goes out, you need to switch automatically to alternative power supply source. In that case the device used to do this its changeover switch or transfer switch.\n\nWhat is the Changeover Switch used for in our country?\n\nA changeover switch is an electrical switch that allows for the power to be changed from one electrical source to another and vice versa, either manually or automatically.\n\nIn our case, if you have a generator, solar system, or any other alternative that can take power from one place and put it back in the grid when the Eskom outages are in place, then you should consider utilizing a changeover switch to help you move seamlessly to the alternative source of power.\n\nOn the other hand, changeover switches can also prevent electrical accidents from occurring on the side of utility employees by making an electrical current move within the correct limits. Also, the changeover switch can prevent the sudden loss of power and thus save some sensitive appliances from burning out due to surges and sudden power loss the only caveat around this is that the alternative power source must be able to take over immediately as in the case of solar batteries storage power.\n\nIn fact, many industries have large and complex electrical systems with multiple generators or large storage solar system can utilize this device in order to get power transferred seamlessly.\n\nTypical  use cases for the changeover switch are:\n\nAt home\nSpaza shops\nHospitals\nSchools\nWarehouses\nSmall and medium sized businesses (SMB)\n\nPractical example wiring at home to change over from one system to antother.\n\nIn the diagram above, the left side pointing to the grid must be connected to plus and minus to whatever you want to siwtch over. Lights or plugs switch only on the on the DB board and the grid can also be swtiched over rather than the entire load or main swtich."},{"name":"Do solar panels work when it's rainy or cloudy?","published":true,"body":"<p class=\"p1\">First of all, I think the question is not whether solar panels can work in cloudy weather. The real question is, what other alternative do we have in South Africa?&nbsp;So what if we have rainy and cloudy conditions? The panels still produce up to 20-30% of their rated capacity. This is still better than having no power at all due to escalating power outages and degenerating Eskom grid infrastructure.</p>\n<p class=\"p1\">In fact, panels work better in cold conditions since heat actually prevents them from reaching the optimal charging capacity. Solar panels require light for them to function, not heat.</p>\n<h2 class=\"p1\">So what happens to solar panels when it&rsquo;s cloudy or raining?</h2>\n<p class=\"p1\">Monocrystalline photovoltaic panels still work even when the light is reflected or partially blocked by clouds for up to 20-30 percent of their maximum operating capacity.</p>\n<p class=\"p1\">The example i always refer to is Germany's implementation of solar farming. How does Germany manage to produce so much solar power when they have no sunshine there most of the year? The answer is that you can double or<span class=\"Apple-converted-space\">&nbsp; </span>triple down on the panels arrays numbers, so if life gives you a lemon you make a lemonade - or a double lemonade in their case. When they get no sun, they just double down on the panels installations and storage to get to where they want to be.</p>\n<h2 class=\"p1\">Conclusion</h2>\n<p class=\"p1\">Solar panels are a great investment regardless of the weather conditions, and in our case its the only alternative we currently have to the Eskom grid power in South Africa. At the end of the day, statistics dictate that South Africa is blessed with sunshine.</p>\n<p class=\"p1\">According to the <a title=\"Government Energy\" href=\"https://www.energy.gov.za/\" target=\"_blank\" rel=\"noopener\">government</a>, most areas in South Africa average more than 2 500 hours of sunshine per year, and average solar-radiation levels range between 4.5 and 6.5kWh/m2 in one day. To put it simply,&nbsp; that&rsquo;s more than enough free power gifted to us by the sun provided we capture it with enough<span class=\"Apple-converted-space\">&nbsp; </span>solar panels and store it within battery storage so that it may be consumed at a later stage .</p>","img":{"url":"cloudy-panel.jpg","title":"Panels on a cloudy day"},"tags":["Cloudy weather","Solar power in bad weather"],"date":"Tue May 23 2023","id":"ar-64an21avli01sakr","plainText":"First of all, I think the question is not whether solar panels can work in cloudy weather. The real question is, what other alternative do we have in South Africa? So what if we have rainy and cloudy conditions? The panels still produce up to 20-30% of their rated capacity. This is still better than having no power at all due to escalating power outages and degenerating Eskom grid infrastructure.\n\nIn fact, panels work better in cold conditions since heat actually prevents them from reaching the optimal charging capacity. Solar panels require light for them to function, not heat.\n\nSo what happens to solar panels when it’s cloudy or raining?\n\nMonocrystalline photovoltaic panels still work even when the light is reflected or partially blocked by clouds for up to 20-30 percent of their maximum operating capacity.\n\nThe example i always refer to is Germany's implementation of solar farming. How does Germany manage to produce so much solar power when they have no sunshine there most of the year? The answer is that you can double or  triple down on the panels arrays numbers, so if life gives you a lemon you make a lemonade - or a double lemonade in their case. When they get no sun, they just double down on the panels installations and storage to get to where they want to be.\n\nConclusion\n\nSolar panels are a great investment regardless of the weather conditions, and in our case its the only alternative we currently have to the Eskom grid power in South Africa. At the end of the day, statistics dictate that South Africa is blessed with sunshine.\n\nAccording to the government, most areas in South Africa average more than 2 500 hours of sunshine per year, and average solar-radiation levels range between 4.5 and 6.5kWh/m2 in one day. To put it simply,  that’s more than enough free power gifted to us by the sun provided we capture it with enough  solar panels and store it within battery storage so that it may be consumed at a later stage ."}]}